'use strict';

const BinStatesNames = {
	"states" : {
		"0" : "Выкл. все"
	},
	"buttons" : {
		"0" : "Кухня вход",
		"1" : "Кухня стол",
		"2" : "Кухня",
		"3" : "Коридор",
		"4" : "Улица",
		"5" : "Холл 1 лево",
		"6" : "Холл 1 право",
		"7" : "Холл 1 низ",
		"8" : "Холл 2 лево",
		"9" : "Холл 2 право",
		"10" : "Холл 2 низ",
		"11" : "Спальня",
		"12" : "Спальня лево",
		"13" : "Спальня право",
		"14" : "Санузел",
		"15" : "С/у зеркало",
		"16" : "С/у вентилятор",
		"17" : "Котельная",
		"25" : "Выкл. все",
		"26" : "Я дома!",
		"27" : "Антивор!",
		"28" : "Гостинная откр",
		"29" : "Кухня откр",
		"30" : "Спальня откр",
		"31" : "Гостинная закр",
		"32" : "Кухня закр",
		"33" : "Спальня закр",
		"34" : "Ночник спальня",
		"35" : "Ночник детская"
	}
};
const BinStatesGroups = [
		{
			"name" : "Свет",
			"uids" : [0, 127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,152,153,154,161,162]
		},
		{
			"name" : "Жалюзи",
			"uids" : [0, 152, 155,156,157,158,159,160]
		}
]

export { BinStatesNames, BinStatesGroups };
