'use strict';

const BinStatesNames = {
	"states" : {
		"0" : "Выкл. все"
	},
	"buttons" : {
		"0" : "Кухня вход",
		"1" : "Кухня стол",
		"2" : "Кухня",
		"3" : "Коридор",
		"4" : "Улица",
		"5" : "Холл 1 лево",
		"6" : "Холл 1 право",
		"7" : "Холл 1 низ",
		"8" : "Холл 2 лево",
		"9" : "Холл 2 право",
		"10" : "Холл 2 низ",
		"11" : "Спальня",
		"12" : "Спальня лево",
		"13" : "Спальня право",
		"14" : "Санузел",
		"15" : "С/у зеркало",
		"16" : "С/у вентилятор",
		"17" : "Котельная",
		"25" : "Выкл. все",
		"26" : "Я дома!",
		"27" : "Антивор!",
		"28" : "1",
		"29" : "2",
		"30" : "3",
		"31" : "4",
		"32" : "5",
		"33" : "6",
		"34" : "7",
		"35" : "8",
		"36" : "9",
		"37" : "10"
	}
};

export default BinStatesNames;
