'use strict';

const BinStatesNames = {
	"states" : {
		"0" : "Выкл. все"
	},
	"buttons" : {
		"0" : "Прихожая",
		"1" : "Прихожая ночь",
		"2" : "Детская центр",
		"3" : "Детская ночь",
		"4" : "Детская 2",
		"5" : "Детская трек",
		"6" : "Спальня",
		"7" : "Спальня ночь лево",
		"8" : "Спальня ночь право",
		"9" : "Холл",
		"10" : "Кухня центр",
		"11" : "Кухня стол",
		"12" : "Кухня шары",
		"13" : "Ванная зеркало",
		"14" : "Балкон",
		"15" : "Холл откр.",
		"16" : "Холл закр.",
		"17" : "Кухня откр.",
		"18" : "Кухня закр.",
		"19" : "Спальня откр",
		"20" : "Спальня закр.",
		"21" : "Детская 2 откр.",
		"22" : "Детская 2 закр",
		"23" : "Детская 1-1 откр.",
		"24" : "Детская 1-1 закр.",
		"25" : "Детская 1-2 откр.",
		"26" : "Детская 1-2 закр.",
		"27" : "Выкл. все",
		"28" : "Я дома!",
		"29" : "Антивор!"
	}
};
const BinStatesGroups = [
		{
			"name" : "Свет",
			"uids" : [0, 127+0, 127+1, 127+2, 127+3, 127+4, 127+5, 127+6, 127+7, 127+8, 127+9, 127+10, 127+11, 127+12, 127+13, 127+14, 127+27, 127+28]
		},
		{
			"name" : "Жалюзи",
			"uids" : [0, 127+15, 127+16, 127+17, 127+18, 127+19, 127+20, 127+21, 127+22, 127+23, 127+24, 127+25, 127+26, 127+27]
		}
]

export { BinStatesNames, BinStatesGroups };
