'use strict';

const BinStatesNames = {
	"states" : {
		"0" : "Выкл. все",
		"1" : "Закр. все жалюзи"
	},
	"buttons" : {
		"0" : "Детская Лера",
		"1" : "Детская Саша",
		"2" : "Детская Яна",
		"3" : "Коридор детский",
		"4" : "Санузел детский",
		"5" : "Зал",
		"6" : "Кухня осн.",
		"7" : "Коридор осн.",
		"8" : "Коридор",
		"9" : "Санузел гостевой",
		"10" : "Прачечная",
		"11" : "Спальня осн.",
		"12" : "Санузел",
		"13" : "Улица",
		"14" : "Кухня доп.",
		"15" : "Спальня доп.",
		"16" : "Коридор детский Н",
		"17" : "Санузел детский Н",
		"18" : "Кухня Н",
		"19" : "Коридор Н",
		"20" : "Санузел гостевой Н",
		"21" : "Санузел Н",
		"22" : "Выкл. все",
		"23" : "Жалюзи закр. все.",
		"24" : "Я дома!",
		"25" : "Ночь дети",
		"26" : "Ночь спальня",
		"27" : "Ночная подсветка",
		"28" : "Закр. все жалюзи",
		"29" : "Спим!"
	}
};
const BinStatesGroups = [
		{
			"name" : "Свет осн.",
			"uids" : [0, 127+0, 127+1, 127+2, 127+3, 127+4, 127+5, 127+6, 127+7, 127+8, 127+9, 127+10, 127+11, 127+12, 127+13, 127+14, 127+15, 127+22, 127+29]
		},
		{
			"name" : "Свет ночь",
			"uids" : [0, 127+16, 127+17, 127+18, 127+19, 127+20, 127+21, 127+22, 127+25, 127+26, 127+27]
		},
		{
			"name" : "Сценарии",
			"uids" : [0, 1, 127+22, 127+23, 127+24, 127+25, 127+26, 127+27, 127+28, 127+29]
		}
]

export { BinStatesNames, BinStatesGroups };
