'use strict';

const BinStatesNames = {
	"states" : {
		"0" : "Закрыть Все"
	},
	"buttons" : {
		"0" : "Лера откр.",
		"1" : "Лера закр.",
		"2" : "Саша откр.",
		"3" : "Саша закр.",
		"4" : "Яна откр.",
		"5" : "Яна закр.",
		"6" : "Зал 1 откр.",
		"7" : "Зал 1 закр.",
		"8" : "Зал 2 откр.",
		"9" : "Зал 2 закр.",
		"10" : "Спальня откр.",
		"11" : "Спальня закр.",
		"12" : "С/у детский Вент.",
		"13" : "С/у гостевой Вент.",
		"14" : "С/у Вент.",
		"15" : "Закрыть Все"
	}
};
const BinStatesGroups = [
		{
			"name" : "Жалюзи",
			"uids" : [0, 127+0, 127+1, 127+2, 127+3, 127+4, 127+5, 127+6, 127+7, 127+8, 127+9, 127+10, 127+11, 127+15]
		},
		{
			"name" : "Вентиляторы",
			"uids" : [127+12, 127+13, 127+14]
		}
]

export { BinStatesNames, BinStatesGroups };
