'use strict';

const BinStatesNames = {
	"states" : {
		"0" : "Выкл. все"
	},
	"buttons" : {
		"0" : "Гараж",
		"1" : "Кладовка",
		"2" : "Прожектор",
		"3" : "Терасса",
		"4" : "Терасса LED",
		"5" : "Дверь",
		"6" : "Резерв",
		"7" : "Выкл. все",
		"8" : "Вся терасса!",
		"9" : "Антивор!"
	}
};
const BinStatesGroups = [
		{
			"name" : "Гараж",
			"uids" : [0, 127+0, 127+1, 127+2, 127+7, 127+9]
		},
		{
			"name" : "Терасса",
			"uids" : [0, 127+3, 127+4, 127+5, 127+7, 127+8, 127+9]
		}
]

export { BinStatesNames, BinStatesGroups };
